## Production: sns_to_sqs_sms_callbacks
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.lambda-image-sns-delivery-receipts-errors-critical must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "lambda-image-sns-delivery-receipts-errors-critical" {
      ~ alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
          - "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      ~ alarm_description                     = "5 errors on Lambda sns-to-sqs-sms-callbacks in 10 minutes" -> "20 errors on Lambda sns-to-sqs-sms-callbacks in 10 minutes"
      ~ alarm_name                            = "lambda-image-sns-delivery-receipts-errors-warning" -> "lambda-image-sns-delivery-receipts-errors-critical" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:ca-central-1:296255494825:alarm:lambda-image-sns-delivery-receipts-errors-warning" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "lambda-image-sns-delivery-receipts-errors-warning" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
      ~ threshold                             = 5 -> 20
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>